Ran Plan for dir: `terraform` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform apply -input=false -no-color \"/home/atlantis/.atlantis/repos/fred-lev/k8s-gcp-lab/23/default/terraform/default-default.tfplan\"" in "/home/atlantis/.atlantis/repos/fred-lev/k8s-gcp-lab/23/default/terraform": exit status 1

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_instance.controller will be created
+ resource "google_compute_instance" "controller" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + labels               = {
          + "kind" = "controller"
        }
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "k8s-lab-controller-01"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "controller",
          + "k8s-lab",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-southeast1-c"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 30
              + type   = "pd-ssd"
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "network-k8s-lab"
          + network_ip         = "10.240.0.11"
          + stack_type         = (known after apply)
          + subnetwork         = "subnetwork-k8s-lab"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = "35.240.251.35"
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + min_node_cpus       = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.worker[0] will be created
+ resource "google_compute_instance" "worker" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + labels               = {
          + "kind" = "workers"
        }
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "k8s-lab-worker-01"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "k8s-lab",
          + "worker",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-southeast1-c"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 30
              + type   = "pd-ssd"
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "network-k8s-lab"
          + network_ip         = "10.240.0.21"
          + stack_type         = (known after apply)
          + subnetwork         = "subnetwork-k8s-lab"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = "34.87.165.221"
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + min_node_cpus       = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.worker[1] will be created
+ resource "google_compute_instance" "worker" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + labels               = {
          + "kind" = "workers"
        }
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "k8s-lab-worker-02"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "k8s-lab",
          + "worker",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-southeast1-c"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 30
              + type   = "pd-ssd"
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "network-k8s-lab"
          + network_ip         = "10.240.0.22"
          + stack_type         = (known after apply)
          + subnetwork         = "subnetwork-k8s-lab"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = "34.87.111.15"
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + min_node_cpus       = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.worker[2] will be created
+ resource "google_compute_instance" "worker" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + labels               = {
          + "kind" = "workers"
        }
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "k8s-lab-worker-03"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "k8s-lab",
          + "worker",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-southeast1-c"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 30
              + type   = "pd-ssd"
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "network-k8s-lab"
          + network_ip         = "10.240.0.23"
          + stack_type         = (known after apply)
          + subnetwork         = "subnetwork-k8s-lab"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = "34.87.118.7"
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + min_node_cpus       = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

google_compute_instance.worker[1]: Creating...
google_compute_instance.controller: Creating...
google_compute_instance.worker[2]: Creating...
google_compute_instance.worker[0]: Creating...
google_compute_instance.worker[1]: Still creating... [10s elapsed]
google_compute_instance.controller: Still creating... [10s elapsed]
google_compute_instance.worker[2]: Still creating... [10s elapsed]
google_compute_instance.worker[0]: Still creating... [10s elapsed]

Error: Error waiting for instance to create: The zone 'projects/tidy-strand-340704/zones/asia-southeast1-c' does not have enough resources available to fulfill the request.  Try a different zone, or try again later.


  with google_compute_instance.controller,
  on nodes.tf line 11, in resource "google_compute_instance" "controller":
  11: resource "google_compute_instance" "controller" {


Error: Error waiting for instance to create: The zone 'projects/tidy-strand-340704/zones/asia-southeast1-c' does not have enough resources available to fulfill the request.  Try a different zone, or try again later.


  with google_compute_instance.worker[0],
  on nodes.tf line 40, in resource "google_compute_instance" "worker":
  40: resource "google_compute_instance" "worker" {


Error: Error waiting for instance to create: The zone 'projects/tidy-strand-340704/zones/asia-southeast1-c' does not have enough resources available to fulfill the request.  Try a different zone, or try again later.


  with google_compute_instance.worker[2],
  on nodes.tf line 40, in resource "google_compute_instance" "worker":
  40: resource "google_compute_instance" "worker" {


Error: Error waiting for instance to create: The zone 'projects/tidy-strand-340704/zones/asia-southeast1-c' does not have enough resources available to fulfill the request.  Try a different zone, or try again later.


  with google_compute_instance.worker[1],
  on nodes.tf line 40, in resource "google_compute_instance" "worker":
  40: resource "google_compute_instance" "worker" {


```
</details>

